In [5]:
import pandas as pd
from IPython.display import display

Pandas is a package built using numpy used for data analysis and manipulation.

In [7]:
# Column Name : Array compatible list of Values
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['Delhi', 'Mumbai', 'Bangalore']
}
df = pd.DataFrame(data)
display(df)

      Name  Age       City
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

1. Load data from CSV

In [9]:
df = pd.read_csv("data.csv")
display(df)

  Customer ID First Name Last Name                 Email ID    Phone Number
0     CUST001       Amit    Sharma  amit.sharma@example.com  +91-9876543210
1     CUST002      Priya     Mehra  priya.mehra@example.com  +91-9123456789
2     CUST003      Rahul     Verma  rahul.verma@example.com  +91-9988776655
3     CUST004      Sneha      Nair   sneha.nair@example.com  +91-9090909090
4     CUST005      Karan     Patel  karan.patel@example.com  +91-9871234567

In [10]:
pd.read_excel
pd.read_json
pd.read_html
pd.read_sql  # compatible with SQLAlchemy
pd.read_xml

<function pandas.io.xml.read_xml(path_or_buffer: 'FilePath | ReadBuffer[bytes] | ReadBuffer[str]', *, xpath: 'str' = './*', namespaces: 'dict[str, str] | None' = None, elems_only: 'bool' = False, attrs_only: 'bool' = False, names: 'Sequence[str] | None' = None, dtype: 'DtypeArg | None' = None, converters: 'ConvertersArg | None' = None, parse_dates: 'ParseDatesArg | None' = None, encoding: 'str | None' = 'utf-8', parser: 'XMLParsers' = 'lxml', stylesheet: 'FilePath | ReadBuffer[bytes] | ReadBuffer[str] | None' = None, iterparse: 'dict[str, list[str]] | None' = None, compression: 'CompressionOptions' = 'infer', storage_options: 'StorageOptions | None' = None, dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>) -> 'DataFrame'>

2. Inspect

In [12]:
display(df.head(3))

  Customer ID First Name Last Name                 Email ID    Phone Number
0     CUST001       Amit    Sharma  amit.sharma@example.com  +91-9876543210
1     CUST002      Priya     Mehra  priya.mehra@example.com  +91-9123456789
2     CUST003      Rahul     Verma  rahul.verma@example.com  +91-9988776655

In [13]:
display(df.tail(3))

  Customer ID First Name Last Name                 Email ID    Phone Number
2     CUST003      Rahul     Verma  rahul.verma@example.com  +91-9988776655
3     CUST004      Sneha      Nair   sneha.nair@example.com  +91-9090909090
4     CUST005      Karan     Patel  karan.patel@example.com  +91-9871234567

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Customer ID   5 non-null      object
 1   First Name    5 non-null      object
 2   Last Name     5 non-null      object
 3   Email ID      5 non-null      object
 4   Phone Number  5 non-null      object
dtypes: object(5)
memory usage: 332.0+ bytes

In [18]:
print(f"Shape = {df.shape}")
print(f"Size = {df.size}")

Shape = (5, 5)
Size = 25

3. describe()

In [20]:
display(df.describe())

,Customer ID,First Name,Last Name,Email ID,Phone Number
count,5,5,5,5,5
unique,5,5,5,5,5
top,CUST001,Amit,Sharma,amit.sharma@example.com,+91-9876543210
freq,1,1,1,1,1